Revit 2027 API
PointCloudFilterFactory Class
 A factory class for creating point cloud filters.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.PointClouds.PointCloudFilterFactory
Namespace: Autodesk.Revit.DB.PointClouds
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class PointCloudFilterFactory
Public NotInheritable Class PointCloudFilterFactory
public ref class PointCloudFilterFactory abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type PointCloudFilterFactory = class end
The PointCloudFilterFactory type exposes the following members.
Methods
Name | Description
CreateMultiPlaneFilter(IList<Plane>) |  Creates a new point cloud filter based upon planar boundaries.
CreateMultiPlaneFilter(IList<Plane>, Int32) |  Creates a new point cloud filter based upon planar boundaries.
Top
See Also
Reference
Autodesk.Revit.DB.PointClouds Namespace